n, k = map(int, input().split(' '))
print(n*n*k)

'''
16488. 피카츄가 낸 어려운 문제
https://www.acmicpc.net/problem/16488

문제
맨날 학교 칠판에 이등변삼각형을 그리고 노는 피카츄가 어느 날, 칠판에 변 AB와 변 AC의 길이가 모두 N인 이등변 삼각형을 그린 다음, 친구들에게 아래와 같은 문제를 냈다.

이등변삼각형 ABC에서 변 BC 위에 점 P1, P2, ··· , PK을 잡는다. (B ≠ Pi ≠ C (i = 1, 2, ··· , K))

i = 1, 2, ··· , K에 대하여 함수 F(i)를 (선분 APi의 길이)²+(선분 BPi의 길이)×(선분 CPi의 길이)로 정의한다.

이때, F(1)+F(2)+···+F(K)의 값은 얼마인지 구하시오.

피카츄의 친구들은 문제 조차도 이해를 못하고 있다! 우리가 대신해서 피카츄가 낸 문제를 해결해 보자.

입력
첫째 줄에 N과 K의 값이 사이에 공백을 한 개 두고 차례대로 주어진다. 단, N과 K는 100,000 이하의 양의 정수이다.

출력
첫째 줄에 문제에서 요구하는 정답을 x라고 할 때, x보다 크지 않은 최대의 정수를 출력한다.
'''